### Importing Libraries

In [1]:
import git,os,json,warnings
from os import walk
from pathlib import Path
import pandas as pd
warnings.filterwarnings("ignore")

In [3]:
# Cloneing the PhonePe Pulse repository (as it is already cloned so commented out)
# git.Git('path').clone('https://github.com/PhonePe/pulse.git')

### we will be having following tables

## Aggregated Transaction and User Table

In [4]:
Agg_Trans_Table = pd.DataFrame({})
Agg_Trans_Summary_Table = pd.DataFrame({})

In [5]:
def data_func(state, year, quarter, path):
    global Agg_Trans_Table
    global Agg_Trans_Summary_Table
    ats = pd.read_json(path)
    
    Agg_Trans_Summary_Table = Agg_Trans_Summary_Table.append(
        {'State': state, 'Year': year, 'Quarter': quarter, 'Data From': ats['data']['from'], 'Data To': ats['data']['to']}, ignore_index=True)

    atd = ats['data']['transactionData']
    if atd:
        for i in atd:
            Agg_Trans_Table = Agg_Trans_Table.append(
                {'Payment Mode': i['name'], 'Total Transactions count': i['paymentInstruments'][0]['count'],
                 'Total Amount': i['paymentInstruments'][0]['amount'], 'Quarter': quarter, 'Year': year, 'State': state}, ignore_index=True)
            
s = r'path\pulse\data\aggregated\transaction\country\india\state'
s_p = os.listdir(r'path\pulse\data\aggregated\transaction\country\india\state')  
for i in s_p:
    p=s+'\\'+i
    for j in os.listdir(p):
        p_t = p+'\\'+j                    
        f1 = []
        for (dirpath, dirnames, filenames) in walk(p_t):
            f1.extend(filenames)        
            break
        for k in f1:                   
            x = p_t+'\\'+k              
            y = Path(x).stem           
            data_func(i, j, y, x)

In [6]:
Agg_User_Table = pd.DataFrame({})
Agg_User_Summary_Table = pd.DataFrame({})

In [7]:
def data_func2(state,year,quarter,path):
    
    global Agg_User_Table
    global Agg_User_Summary_Table
    
    df1 = pd.read_json(path)
    Agg_User_Summary_Table= Agg_User_Summary_Table.append(
        {'State':state,'Year': year,'Quarter':quarter,'Registered Users':df1['data']['aggregated']['registeredUsers'],
         'AppOpenings':df1['data']['aggregated']['appOpens']}, ignore_index = True )
    
    if df1['data']['usersByDevice']:  
        for i in df1['data']['usersByDevice']:
            Agg_User_Table = Agg_User_Table.append(
                {'Brand Name':i['brand'], 'Registered Users Count':i['count'], 'Percentage Share of Brand':i['percentage'],
                 'Quarter':quarter,'Year': year,'State':state}, ignore_index = True)

s1= r'path\pulse\data\aggregated\user\country\india\state'
s1_p = os.listdir(r'path\pulse\data\aggregated\user\country\india\state')

for i in s1_p:
    p1=s1+'\\'+i
    for j in os.listdir(p1):
        p1_t=p1+'\\'+j
        f2=[]
        for (dirpath, dirnames, filenames) in walk(p1_t):
            f2.extend(filenames)
            break
        for k in f2:
            pf=p1_t+'\\'+k            
            pn=Path(pf).stem
            data_func2(i,j,pn,pf)

## Map Transaction & User Table

In [8]:
Map_User_Table = pd.DataFrame({})

In [9]:
path = "path\\pulse\\data\\map\\transaction\\hover\\country\\india\\state\\"
Map_state_list = os.listdir(path)
Map_state_list
clm = {'District_name': [], 'Transaction_count': [], 'Transaction_amount': [], 'Quater': [],'Year': [],'State': []}
for i in Map_state_list:
    p_i = path + i + "/"
    Map_yr = os.listdir(p_i)
    for j in Map_yr:
        p_j = p_i + j + "/"
        Map_yr_list = os.listdir(p_j)
        for k in Map_yr_list:
            p_k = p_j + k
            Data = open(p_k, 'r')
            D = json.load(Data)
            for z in D['data']['hoverDataList']:
                Name = z['name']
                count = z['metric'][0]['count']
                amount = z['metric'][0]['amount']
                clm['District_name'].append(Name)
                clm['Transaction_count'].append(count)
                clm['Transaction_amount'].append(amount)
                clm['State'].append(i)
                clm['Year'].append(j)
                clm['Quater'].append(int(k.strip('.json')))

In [10]:
Map_Transaction_Table = pd.DataFrame(clm)

In [11]:
def data_func4(state,year,quarter,path):
    global Map_User_Table
    dfmu = pd.read_json(path)
    if dfmu['data']['hoverData']:
        for i in dfmu['data']['hoverData']: 
            Map_User_Table = Map_User_Table.append({'District Name':i, 'Registered Users Count':dfmu['data']['hoverData'][i]['registeredUsers'], 'App Openings':dfmu['data']['hoverData'][i]['appOpens'],'Quarter':quarter,'Year': year,'State':state}, ignore_index = True)

su= r'path\pulse\data\map\user\hover\country\india\state'
t_su = os.listdir(r'path\pulse\data\map\user\hover\country\india\state') 
for i in t_su:
    p=su+'\\'+i
    for j in os.listdir(p):
        pt=p+'\\'+j
        f4=[]
        for (dirpath, dirnames, filenames) in walk(pt):
            f4.extend(filenames)
            break
        for k in f4:
            mup=pt+'\\'+k            
            muq=Path(mup).stem
            data_func4(i,j,muq,mup)

## Top Transaction & User

In [12]:
path = "path\\pulse\\data\\top\\user\\country\\india\\state\\"

Top_state_list = os.listdir(path)
clm = {'District_name': [], 'Reg_users': [], 'Pincodes': [], 'Reg_users_pin': [],  'Quater': [],'Year': [],'State': [] }
for i in Top_state_list:
    p_i = path + i + "/"
    Top_yr = os.listdir(p_i)
    for j in Top_yr:
        p_j = p_i + j + "/"
        Top_yr_list = os.listdir(p_j)
        for k in Top_yr_list:
            p_k = p_j + k
            Data = open(p_k, 'r')
            D = json.load(Data)
            for z in D['data']['districts']:
                name1 = z['name']
                Users1 = z['registeredUsers']
            for a in D['data']['pincodes']:
                name2 = a['name']
                Users2 = a['registeredUsers']
                clm['District_name'].append(name1)
                clm['Reg_users'].append(Users1)
                clm['Reg_users_pin'].append(Users2)
                clm['Pincodes'].append(name2)
                clm['State'].append(i)
                clm['Year'].append(j)
                clm['Quater'].append(int(k.strip('.json')))

In [13]:
path = "path\\pulse\\data\\top\\transaction\\country\\india\\state\\"
Top_state_list = os.listdir(path)
clm = {'District_name': [], 'Transaction_count': [], 'Transaction_amount': [],   'Quater': [],'Year': [],'State': []}
for i in Top_state_list:
    p_i = path + i + "/"
    Top_yr = os.listdir(p_i)
    for j in Top_yr:
        p_j = p_i + j + "/"
        Top_yr_list = os.listdir(p_j)
        for k in Top_yr_list:
            p_k = p_j + k
            Data = open(p_k, 'r')
            D = json.load(Data)
            for z in D['data']['districts']:
                name = z['entityName']
                count = z['metric']['count']
                amount = z['metric']['amount']
                clm['District_name'].append(name)
                clm['Transaction_count'].append(count)
                clm['Transaction_amount'].append(amount)
                clm['State'].append(i)
                clm['Year'].append(j)
                clm['Quater'].append(int(k.strip('.json')))

In [14]:
Top_User_Table=pd.DataFrame(clm)
Top_Trans_Table = pd.DataFrame(clm)

In [15]:
Agg_Trans_Table.to_csv('Agg_Trans_Table.csv',index=False)
Agg_Trans_Summary_Table.to_csv('Agg_Trans_Summary_Table.csv',index=False)
Agg_User_Summary_Table.to_csv('Agg_User_Summary_Table' ,index=False)
Agg_User_Table.to_csv('Agg_User_Table' ,index=False)
Map_Transaction_Table.to_csv('Map_Transaction_Table.csv', index=False)
Map_User_Table.to_csv('Map_User_Table.csv',index=False)
Top_Trans_Table.to_csv('Top_Trans_Table.csv', index=False)
Top_User_Table.to_csv('Top_User_Table.csv', index=False)

In [16]:
Longitude_Latitude_State_Table=pd.read_csv('path\\Data\\Longitude_Latitude_State_Table.csv')
Map_Districts_Longitude_Latitude=pd.read_csv('path\\Data\\Map_Districts_Longitude_Latitude.csv')

## Connecting to Sql and Uploading DataBase

In [17]:
from sqlalchemy import create_engine
import mysql.connector

In [18]:
conn = mysql.connector.connect(host='localhost', user='root', password='root')
cursor = conn.cursor()
cursor.execute("DROP DATABASE IF EXISTS project2")
print("Database 'project2' dropped successfully.")
conn.close()

Database 'project2' dropped successfully.

In [19]:

conn = mysql.connector.connect(host='localhost', user='root', password='root')
cursor = conn.cursor()
database_name = 'project2'
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {database_name}")
print(f"Database '{database_name}' created successfully.")
cursor.execute(f"USE {database_name}")
engine = create_engine('mysql+mysqlconnector://root:root@localhost/project2', echo=False)

Database 'project2' created successfully.

In [20]:
Agg_Trans_Table.to_sql('Agg_Trans_Table', engine)
Agg_Trans_Summary_Table.to_sql('Agg_Trans_Summary_Table', engine)
Agg_User_Summary_Table.to_sql('Agg_User_Summary_Table', engine)
Agg_User_Table.to_sql('Agg_User_Table', engine)
Map_Transaction_Table.to_sql('Map_Transaction_Table', engine)
Map_User_Table.to_sql('Map_User_Table', engine)
Top_Trans_Table.to_sql('Top_Trans_Table', engine)
Top_User_Table.to_sql('Top_User_Table', engine)
Longitude_Latitude_State_Table.to_sql('Longitude_Latitude_State_Table', engine)
Map_Districts_Longitude_Latitude.to_sql('Map_Districts_Longitude_Latitude', engine)
print('All Tables Uploaded Sucessfully')
conn.close()

All Tables Uploaded Sucessfully

In [21]:
#Map_Transaction_Table.to_sql('Map_Transaction_Table', engine)  #Programming Error

In [22]:
conn.close()

In [23]:
# Configuring engine to fetch all data
conn = mysql.connector.connect(host="localhost",user="root",password="root",database="project2")
engine = create_engine('mysql+mysqlconnector://root:root@localhost/project2', echo=False)

In [24]:
# define SQL queries to fetch data from MySQL tables
Agg_Trans_Table_query = 'SELECT * FROM Agg_Trans_Table'
Agg_Trans_Summary_Table_query = 'SELECT * FROM Agg_Trans_Summary_Table'
Agg_User_Summary_Table_query = 'SELECT * FROM Agg_User_Summary_Table'
Agg_User_Table_query = 'SELECT * FROM Agg_User_Table'
Map_Transaction_Table_query = 'SELECT * FROM Map_Transaction_Table'
Map_User_Table_query = 'SELECT * FROM Map_User_Table'
Top_Trans_Table_query = 'SELECT * FROM Top_Trans_Table'
Top_User_Table_query = 'SELECT * FROM Top_User_Table'
Longitude_Latitude_State_Table_query='SELECT * FROM Longitude_Latitude_State_Table'
Map_Districts_Longitude_Latitude_query='SELECT * FROM Map_Districts_Longitude_Latitude'

In [25]:
# fetch data from MySQL tables into dataframes
Agg_Trans_Table = pd.read_sql(Agg_Trans_Table_query, con=conn)
Agg_Trans_Summary_Table =pd.read_sql(Agg_Trans_Summary_Table_query, con=conn)
Agg_User_Summary_Table = pd.read_sql(Agg_User_Summary_Table_query, con=conn)
Agg_User_Table = pd.read_sql(Agg_User_Table_query, con=conn)
Map_Transaction_Table = pd.read_sql(Map_Transaction_Table_query, con=conn)
Map_User_Table = pd.read_sql(Map_User_Table_query, con=conn)
Top_Trans_Table = pd.read_sql(Top_Trans_Table_query, con=conn)
Top_User_Table = pd.read_sql(Top_User_Table_query, con=conn)
Longitude_Latitude_State_Table=pd.read_sql(Longitude_Latitude_State_Table_query, con=conn)
Map_Districts_Longitude_Latitude=pd.read_sql(Map_Districts_Longitude_Latitude_query, con=conn)
conn.close()

In [26]:
Agg_Trans_Table.head(3)

,index,Payment Mode,Total Transactions count,Total Amount,Quarter,Year,State
0,0,Recharge & bill payments,4200,1.845307e+06,1,2018,andaman-&-nicobar-islands
1,1,Peer-to-peer payments,1871,1.213866e+07,1,2018,andaman-&-nicobar-islands
2,2,Merchant payments,298,4.525072e+05,1,2018,andaman-&-nicobar-islands

In [27]:
Agg_Trans_Summary_Table.head(3)

,index,State,Year,Quarter,Data From,Data To
0,0,andaman-&-nicobar-islands,2018,1,1514745000000,1522175400000
1,1,andaman-&-nicobar-islands,2018,2,1522521000000,1530124200000
2,2,andaman-&-nicobar-islands,2018,3,1530383400000,1538073000000

In [28]:
Agg_User_Summary_Table.head(3)

,index,State,Year,Quarter,Registered Users,AppOpenings
0,0,andaman-&-nicobar-islands,2018,1,6740,0
1,1,andaman-&-nicobar-islands,2018,2,9405,0
2,2,andaman-&-nicobar-islands,2018,3,12149,0

In [29]:
Agg_User_Table.head(3)

,index,Brand Name,Registered Users Count,Percentage Share of Brand,Quarter,Year,State
0,0,Xiaomi,1665,0.247033,1,2018,andaman-&-nicobar-islands
1,1,Samsung,1445,0.214392,1,2018,andaman-&-nicobar-islands
2,2,Vivo,982,0.145697,1,2018,andaman-&-nicobar-islands

In [30]:
Map_Transaction_Table.head(3)

,index,District_name,Transaction_count,Transaction_amount,Quater,Year,State
0,0,north and middle andaman district,442,9.316631e+05,1,2018,andaman-&-nicobar-islands
1,1,south andaman district,5688,1.256025e+07,1,2018,andaman-&-nicobar-islands
2,2,nicobars district,528,1.139849e+06,1,2018,andaman-&-nicobar-islands

In [31]:
Map_User_Table.head(3)

,index,District Name,Registered Users Count,App Openings,Quarter,Year,State
0,0,north and middle andaman district,632,0,1,2018,andaman-&-nicobar-islands
1,1,south andaman district,5846,0,1,2018,andaman-&-nicobar-islands
2,2,nicobars district,262,0,1,2018,andaman-&-nicobar-islands

In [32]:
Top_Trans_Table.head(3)

,index,District_name,Transaction_count,Transaction_amount,Quater,Year,State
0,0,south andaman,5688,1.256025e+07,1,2018,andaman-&-nicobar-islands
1,1,nicobars,528,1.139849e+06,1,2018,andaman-&-nicobar-islands
2,2,north and middle andaman,442,9.316631e+05,1,2018,andaman-&-nicobar-islands

In [33]:
Top_User_Table.head(3)

,index,District_name,Transaction_count,Transaction_amount,Quater,Year,State
0,0,south andaman,5688,1.256025e+07,1,2018,andaman-&-nicobar-islands
1,1,nicobars,528,1.139849e+06,1,2018,andaman-&-nicobar-islands
2,2,north and middle andaman,442,9.316631e+05,1,2018,andaman-&-nicobar-islands

In [34]:
Longitude_Latitude_State_Table.head(3)

   index code   Latitude  Longitude          state
0      0   PY  10.915649  79.806949     Puducherry
1      1   TN  10.909433  78.366535     Tamil Nadu
2      2   UP  27.130334  80.859666  Uttar Pradesh

In [35]:
Map_Districts_Longitude_Latitude.head(3)

,index,State,District,Latitude,Longitude
0,0,andaman-&-nicobar-islands,north and middle andaman district,11.554828,92.238490
1,1,andaman-&-nicobar-islands,south andaman district,10.705690,92.487468
2,2,andaman-&-nicobar-islands,nicobars district,10.705690,92.487468